#+title:     Exercises in SICP Chapter 1
#+author:    Jason Huang
#+email:     huangmianrui0310@outlook.com
#+date:      <2021-04-08 Thu>

#+description:  Exercises and solutions in SICP chapter 1
#+keywords:     sicp, exercises, solutions, lisp, scheme
#+language:     en
#+startup:      content
#+exclude_tags: noexport

*** Solution

#+NAME: solution1.11-recursive
#+BEGIN_SRC scheme
(define (f n)
  (if (< n 3) n
    (+ (f (- n 1)) (* 2 (f (- n 2))) (* 3 (f (- n 3))))))
(f 6)
#+END_SRC

#+RESULTS: solution1.11-recursive
: 59

#+NAME: solution1.11-iterative
#+BEGIN_SRC scheme
(define (f n) (f-iter 0 1 2 n))
(define (f-iter a b c n)
  (cond ((<= n 0) a)
        (else (f-iter b
                      c
                      (+ (* 3 a) (* 2 b) c)
                      (- n 1)))))
(f 6)
#+END_SRC

#+RESULTS: solution1.11-iterative
: 59

#+NAME: processing-f6
| n |  a |   b |   c |
|---+----+-----+-----|
| 6 |  0 |   1 |   2 |
| 5 |  1 |   2 |   4 |
| 4 |  2 |   4 |  11 |
| 3 |  4 |  11 |  25 |
| 2 | 11 |  25 |  59 |
| 1 | 25 |  59 | 142 |
| 0 | 59 | 142 | 335 |
#+TBLFM: @3$2..@>$2=@-1$+1::@3$3..@>$3=@-1$+1::@3$4..@>$4=3*@-1$-2+2*@-1$-1+@-1$0

*** Solution

#+name: solution1.12-1
#+begin_src scheme
(define (pascal-triangle row col)
  (cond ((> col row) 0)
        ((< col 0) 0)
        ((= col 1) 1)
        ((+ (pascal-triangle (- row 1) (- col 1))
            (pascal-triangle (- row 1) col)))))
(pascal-triangle 5 3)
#+end_src

#+RESULTS: solution1.12-1
: 6

#+name: solution1.12-2
#+begin_src scheme :results output
(define (pascal r c)
  (if (or (= c 1) (= c r))
      1
      (+ (pascal (- r 1) (- c 1)) (pascal (- r 1) c))))
(define (display-pascal-row n)
  (define (column-iter i)
    (display (pascal n i)) (display "  ")
    (if (= i n)
        (newline)
        (column-iter (+ i 1))))
  (column-iter 1))
(define (display-pascal n)
  (define (display-pascal-iter i)
    (display-pascal-row i)
    (if (= i n)
        (newline)
        (display-pascal-iter (+ i 1))))
  (display-pascal-iter 1))
(display-pascal 5)
#+end_src

#+RESULTS: solution1.12-2
: 1
: 1  1
: 1  2  1
: 1  3  3  1
: 1  4  6  4  1
:

*** Solution

When /n/ is even, we can rewrite the equation \(ab^{n}\) as:
\begin{align*}
ab^{n}=a(b^{n/2})^{2}&=a(b^{2})^{n/2}=a'b^{\prime n'} \\
a'&=a \\
b'&=b^{2} \\
n'&=n/2
\end{align*}

When /n/ is odd, we can rewrite the equation \(ab^{n}\) as:
\begin{align*}
ab^{n}=abb^{n-1}&=(ab)b^{n-1}=a'b^{\prime n'} \\
a'&=ab \\
b'&=b \\
n'&=n-1
\end{align*}

#+name: solution1.16
#+begin_src scheme
(define (fast-expt b n)
  (fast-expt-iter 1 b n))
(define (fast-expt-iter a b n)
  (cond ((= n 0) a)
        ((even? n) (fast-expt-iter a (* b b) (/ n 2)))
        (else (fast-expt-iter (* a b) b (- n 1)))))
(define (even? n)
  (= (remainder n 2) 0))
(fast-expt 2 10)
#+end_src

#+RESULTS: solution1.16
: 1024

*** Solution

An invariant when /b/ is even is:
\begin{align*}
a \times b=a\times\left(2\times\frac{b}{2}\right)&=(2a)\times\left(\frac{b}{2}\right)=a'\times b' \\
a'&=2a \\
b'&=\frac{b}{2}
\end{align*}

#+name: solution1.17
#+begin_src scheme
(define (even? n)
  (= (remainder n 2) 0))

(define (double x)
  (* x 2))

(define (halve x)
  (/ x 2))

(define (fast-mult a b)
  (cond ((= b 0) 0)
        ((even? b) (fast-mult (double a) (halve b)))
        (else (+ a (fast-mult a (- b 1))))))

(fast-mult 17 19)
#+end_src

#+RESULTS: solution1.17
: 323

*** Solution

An invariant when /b/ is even is:
\begin{align*}
a\times b+c=a\times\left(2\times\frac{b}{2}\right)+c&=(2a)\times\left(\frac{b}{2}\right)+c=a'\times b'+c' \\
a'&=2a \\
b'&=\frac{b}{2} \\
c'&=c
\end{align*}

An invariant when /b/ is odd is:
\begin{align*}
a\times b+c=a\times(1+(b-1))+c&=a\times(b-1)+(a+c)=a'\times b'+c' \\
a'&=a \\
b'&=(b-1) \\
c'&=(a+c)
\end{align*}

/c/ is an accumulator started from 0.

#+name: solution1.18
#+begin_src scheme
(define (even? n) (= (remainder n 2) 0))
(define (double x) (* x 2))
(define (halve x) (/ x 2))

(define (mult a b)
  (define (mult-iter a b c)
    (cond ((= b 0) c)
          ((even? b) (mult-iter (double a) (halve b) c))
          (else (mult-iter a (- b 1) (+ a c)))))
  (mult-iter a b 0))

(mult 17 19)
#+end_src

#+RESULTS: solution1.18
: 323

Another invariant when /b/ is odd is:
\begin{align*}
a\times b+c=a\times(b-1)+(a+c)&=2a\times\frac{b-1}{2}+(a+c)=a'\times b'+c' \\
a'&=2a \\
b'&=\frac{b-1}{2} \\
c'&=(a+c)
\end{align*}

#+name: solution1.18-alternative
#+begin_src scheme
(define (even? n) (= (remainder n 2) 0))
(define (double x) (* x 2))
(define (halve x) (/ x 2))

(define (mult a b)
  (define (mult-iter a b c)
    (cond ((= b 0) c)
          ((even? b) (mult-iter (double a) (halve b) c))
          (else (mult-iter (double a) (halve (- b 1)) (+ a c)))))
  (mult-iter a b 0))

(mult 17 19)
#+end_src

#+RESULTS: solution1.18-alternative
: 323

*** Solution

To expand \(T_{pq}(T_{pq}(a,b))\) and refactor it as \(a\leftarrow bq' + aq' + ap'\) and \(b \leftarrow bp' + aq'\):

\begin{align*}
T_{pq}(a,b)&=(bq+aq+ap, bp+aq) \\
T_{pq}(T_{pq}(a,b))&=((bp+aq)q+(bq+aq+ap)q+(bq+aq+ap)p, (bp+aq)p+(bq+aq+ap)q) \\
T_{pq}(T_{pq}(a,b))&=(bpq+aq^2+bq^2+aq^2+apq+bpq+apq+ap^2, bp^2+apq+bq^2+aq^2+apq) \\
T_{pq}(T_{pq}(a,b))&=(b(2pq+q^2)+a(2pq+q^2)+a(p^2+q^2), b(p^2+q^2)+a(2pq+q^2))=T_{p'q'}
\end{align*}

So, we can get those equations below:

\begin{align*}
p'=p^2+q^2 \\
q'=2pq+q^2
\end{align*}

#+name: solution1.19
#+begin_src scheme
(define (fib n)
  (fib-iter 1 0 0 1 n))
(define (fib-iter a b p q count)
  (cond ((= count 0) b)
        ((even? count)
         (fib-iter a
                   b
                   (+ (* p p) (* q q))
                   (+ (* 2 p q) (* q q))
                   (/ count 2)))
        (else (fib-iter (+ (* b q) (* a q) (* a p))
                        (+ (* b p) (* a q))
                        p
                        q
                        (- count 1)))))

(fib 17)
#+end_src

#+RESULTS: solution1.19
: 1597

*** Solution

#+begin_src scheme :noweb yes :results output
<<smallest-divisor-ex>>

(display (smallest-divisor 199))
(newline)
(display (smallest-divisor 1999))
(newline)
(display (smallest-divisor 19999))
#+end_src

#+RESULTS:
: 199
: 1999
: 7

*** Solution

#+name: search-for-primes
#+begin_src scheme :exports none
(define (prime? n)
  (= n (smallest-divisor n)))

(define (search-for-primes start-range end-range)
  (if (even? start-range)
      (search-for-primes (+ 1 start-range) end-range)
      (cond ((> start-range end-range)
             (newline)
             (display "done"))
            (else (timed-prime-test start-range)
                  (search-for-primes (+ 2 start-range) end-range)))))
#+end_src

#+name: solution1.22
#+begin_src scheme :noweb yes :results output
<<smallest-divisor-ex>>
<<timed-prime-test>>
<<search-for-primes>>

(search-for-primes 1000 1020)
(newline)
(search-for-primes 10000 10040)
(newline)
(search-for-primes 100000 100050)
(newline)
(search-for-primes 1000000 1000050)
#+end_src

#+RESULTS: solution1.22
#+begin_example :exports none

1001
1003
1005
1007
1009 *** 0.001953125
1011
1013 *** 0.001953125
1015
1017
1019 *** 0.001953125
done

10001
10003
10005
10007 *** 0.006103515625
10009 *** 0.006103515625
10011
10013
10015
10017
10019
10021
10023
10025
10027
10029
10031
10033
10035
10037 *** 0.005859375
10039 *** 0.0048828125
done

100001
100003 *** 0.016845703125
100005
100007
100009
100011
100013
100015
100017
100019 *** 0.01806640625
100021
100023
100025
100027
100029
100031
100033
100035
100037
100039
100041
100043 *** 0.017822265625
100045
100047
100049 *** 0.016845703125
done

1000001
1000003 *** 0.0791015625
1000005
1000007
1000009
1000011
1000013
1000015
1000017
1000019
1000021
1000023
1000025
1000027
1000029
1000031
1000033 *** 0.094970703125
1000035
1000037 *** 0.068115234375
1000039 *** 0.05615234375
1000041
1000043
1000045
1000047
1000049
done
#+end_example

*** Solution

#+name: solution1.23
#+begin_src scheme :noweb yes :results output
<<smallest-divisor>>
<<timed-prime-test>>
<<search-for-primes>>

(define (next num)
  (if (= num 2) 3
      (+ 2 num)))
(define (find-divisor n test-divisor)
  (cond ((> (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (else (find-divisor n (next test-divisor)))))

(search-for-primes 1000 1070)
(newline)
(search-for-primes 10000 10110)
(newline)
(search-for-primes 100000 100170)
(newline)
(search-for-primes 1000000 1000180)
#+end_src

#+RESULTS: solution1.23
#+begin_example

1001
1003
1005
1007
1009 *** 0.0009765625
1011
1013 *** 0.0009765625
1015
1017
1019 *** 0.001953125
1021 *** 0.0009765625
1023
1025
1027
1029
1031 *** 0.0009765625
1033 *** 0.0009765625
1035
1037
1039 *** 0.001953125
1041
1043
1045
1047
1049 *** 0.0009765625
1051 *** 0.0009765625
1053
1055
1057
1059
1061 *** 0.0009765625
1063 *** 0.0009765625
1065
1067
1069 *** 0.001220703125
done

10001
10003
10005
10007 *** 0.004150390625
10009 *** 0.004150390625
10011
10013
10015
10017
10019
10021
10023
10025
10027
10029
10031
10033
10035
10037 *** 0.005859375
10039 *** 0.00390625
10041
10043
10045
10047
10049
10051
10053
10055
10057
10059
10061 *** 0.00390625
10063
10065
10067 *** 0.00390625
10069 *** 0.004150390625
10071
10073
10075
10077
10079 *** 0.004150390625
10081
10083
10085
10087
10089
10091 *** 0.004150390625
10093 *** 0.00390625
10095
10097
10099 *** 0.0029296875
10101
10103 *** 0.004150390625
10105
10107
10109
done

100001
100003 *** 0.02685546875
100005
100007
100009
100011
100013
100015
100017
100019 *** 0.050048828125
100021
100023
100025
100027
100029
100031
100033
100035
100037
100039
100041
100043 *** 0.01220703125
100045
100047
100049 *** 0.010986328125
100051
100053
100055
100057 *** 0.010986328125
100059
100061
100063
100065
100067
100069 *** 0.011962890625
100071
100073
100075
100077
100079
100081
100083
100085
100087
100089
100091
100093
100095
100097
100099
100101
100103 *** 0.01220703125
100105
100107
100109 *** 0.02392578125
100111
100113
100115
100117
100119
100121
100123
100125
100127
100129 *** 0.011962890625
100131
100133
100135
100137
100139
100141
100143
100145
100147
100149
100151 *** 0.026123046875
100153 *** 0.01708984375
100155
100157
100159
100161
100163
100165
100167
100169 *** 0.027099609375
done

1000001
1000003 *** 0.036865234375
1000005
1000007
1000009
1000011
1000013
1000015
1000017
1000019
1000021
1000023
1000025
1000027
1000029
1000031
1000033 *** 0.06201171875
1000035
1000037 *** 0.052001953125
1000039 *** 0.049072265625
1000041
1000043
1000045
1000047
1000049
1000051
1000053
1000055
1000057
1000059
1000061
1000063
1000065
1000067
1000069
1000071
1000073
1000075
1000077
1000079
1000081 *** 0.0361328125
1000083
1000085
1000087
1000089
1000091
1000093
1000095
1000097
1000099 *** 0.035888671875
1000101
1000103
1000105
1000107
1000109
1000111
1000113
1000115
1000117 *** 0.035888671875
1000119
1000121 *** 0.0361328125
1000123
1000125
1000127
1000129
1000131
1000133 *** 0.072021484375
1000135
1000137
1000139
1000141
1000143
1000145
1000147
1000149
1000151 *** 0.035888671875
1000153
1000155
1000157
1000159 *** 0.035888671875
1000161
1000163
1000165
1000167
1000169
1000171 *** 0.035888671875
1000173
1000175
1000177
1000179
done
#+end_example

*** Solution

#+name: solution1.24
#+begin_src scheme :noweb yes :results output
<<smallest-divisor>>
<<timed-prime-test>>
<<search-for-primes>>

<<expmod>>
<<fermat-test>>
<<fast-prime-test>>

(define (start-prime-test n start-time)
  (if (fast-prime? n 100)
      (report-prime (- (runtime) start-time))
      "nothing"))

(search-for-primes 1000 1070)
(newline)
(search-for-primes 10000 10110)
(newline)
(search-for-primes 100000 100170)
(newline)
(search-for-primes 1000000 1000180)
#+end_src

#+RESULTS: solution1.24
#+begin_example

1001
1003
1005
1007
1009 *** 0.10498046875
1011
1013 *** 0.15185546875
1015
1017
1019 *** 0.111083984375
1021 *** 0.09814453125
1023
1025
1027
1029
1031 *** 0.083984375
1033 *** 0.079833984375
1035
1037
1039 *** 0.087890625
1041
1043
1045
1047
1049 *** 11.0390625
1051 *** 0.135009765625
1053
1055
1057
1059
1061 *** 0.083984375
1063 *** 0.087890625
1065
1067
1069 *** 0.111083984375
done

10001
10003
10005
10007 *** 0.118896484375
10009 *** 0.115234375
10011
10013
10015
10017
10019
10021
10023
10025
10027
10029
10031
10033
10035
10037 *** 0.14794921875
10039 *** 0.134765625
10041
10043
10045
10047
10049
10051
10053
10055
10057
10059
10061 *** 0.119140625
10063
10065
10067 *** 0.1611328125
10069 *** 0.1181640625
10071
10073
10075
10077
10079 *** 0.1259765625
10081
10083
10085
10087
10089
10091 *** 0.1220703125
10093 *** 0.18701171875
10095
10097
10099 *** 0.168212890625
10101
10103 *** 0.195068359375
10105
10107
10109
done

100001
100003 *** 0.136962890625
100005
100007
100009
100011
100013
100015
100017
100019 *** 0.14111328125
100021
100023
100025
100027
100029
100031
100033
100035
100037
100039
100041
100043 *** 0.171142578125
100045
100047
100049 *** 0.13818359375
100051
100053
100055
100057 *** 0.16015625
100059
100061
100063
100065
100067
100069 *** 0.14208984375
100071
100073
100075
100077
100079
100081
100083
100085
100087
100089
100091
100093
100095
100097
100099
100101
100103 *** 0.136962890625
100105
100107
100109 *** 0.137939453125
100111
100113
100115
100117
100119
100121
100123
100125
100127
100129 *** 0.14794921875
100131
100133
100135
100137
100139
100141
100143
100145
100147
100149
100151 *** 0.14501953125
100153 *** 0.161865234375
100155
100157
100159
100161
100163
100165
100167
100169 *** 0.136962890625
done

1000001
1000003 *** 0.257080078125
1000005
1000007
1000009
1000011
1000013
1000015
1000017
1000019
1000021
1000023
1000025
1000027
1000029
1000031
1000033 *** 0.157958984375
1000035
1000037 *** 0.162109375
1000039 *** 0.199951171875
1000041
1000043
1000045
1000047
1000049
1000051
1000053
1000055
1000057
1000059
1000061
1000063
1000065
1000067
1000069
1000071
1000073
1000075
1000077
1000079
1000081 *** 0.158935546875
1000083
1000085
1000087
1000089
1000091
1000093
1000095
1000097
1000099 *** 0.214111328125
1000101
1000103
1000105
1000107
1000109
1000111
1000113
1000115
1000117 *** 0.1669921875
1000119
1000121 *** 0.18701171875
1000123
1000125
1000127
1000129
1000131
1000133 *** 0.1630859375
1000135
1000137
1000139
1000141
1000143
1000145
1000147
1000149
1000151 *** 0.169921875
1000153
1000155
1000157
1000159 *** 0.2880859375
1000161
1000163
1000165
1000167
1000169
1000171 *** 0.343017578125
1000173
1000175
1000177
1000179
done
#+end_example

*** Solution

#+name: solution1.27
#+begin_src scheme :exports none
(define (carmichael-number? n)
  (define (try-it n a)
    (cond ((= a 1) true)
          ((not (= (expmod a n n) a)) f)
          (else (try-it n (- a 1)))))
  (try-it n (- n 1)))
#+end_src

#+begin_src scheme :noweb yes :results output
(define (square x) (* x x))

<<expmod>>
<<solution1.27>>

(display (carmichael-number? 561))  (newline)
(display (carmichael-number? 1105)) (newline)
(display (carmichael-number? 1729)) (newline)
(display (carmichael-number? 2465)) (newline)
(display (carmichael-number? 2821)) (newline)
(display (carmichael-number? 6601)) (newline)
#+end_src

#+RESULTS:
: #t
: #t
: #t
: #t
: #t
: #t

*** Solution

#+name: miller-rabin-test
#+begin_src scheme :exports none
(define (miller-rabin-test n)
  (define (try-it a)
    (= (expmod-checked a (- n 1) n) 1))
  (try-it (+ 1 (random (- n 1)))))
#+end_src

#+name: remainder-square-checked
#+begin_src scheme :exports none
(define (remainder-square-checked x m)
  (if (and (not (or (= x 1)
                    (= x (- m 1))))
           (= (remainder (* x x) m) 1))
      0
      (remainder (* x x) m)))
#+end_src

#+name: expmod-checked
#+begin_src scheme :exports none
(define (expmod-checked base exp m)
  (cond ((= exp 0) 1)
        ((even? exp)
         (remainder-square-checked (expmod-checked base (/ exp 2) m) m))
        (else
         (remainder (* base (expmod-checked base (- exp 1) m))
                    m))))
#+end_src

#+name: miller-rabin-prime?
#+begin_src scheme :exports none
(define (miller-rabin-prime? n times)
  (cond ((= times 0) #t)
        ((miller-rabin-test n)
         (miller-rabin-prime? n (- times 1)))
        (else #f)))
#+end_src

#+name: solution1.28
#+begin_src scheme :noweb yes :results output
<<miller-rabin-test>>
<<remainder-square-checked>>
<<expmod-checked>>
<<miller-rabin-prime?>>

(define (assert-result test-name actual expected)
  (display (if (eq? actual expected) "pass: " "fail: "))
  (display test-name)
  (newline))

(assert-result "   2 is prime"     (miller-rabin-prime?    2 10) #t)
(assert-result "1009 is prime"     (miller-rabin-prime? 1009 10) #t)
(assert-result "   4 is not prime" (miller-rabin-prime?    4 10) #f)
(assert-result "  99 is not prime" (miller-rabin-prime?   99 10) #f)
(assert-result " 561 is not prime" (miller-rabin-prime?  561 10) #f)
#+end_src

#+RESULTS: solution1.28
: pass:    2 is prime
: pass: 1009 is prime
: pass:    4 is not prime
: pass:   99 is not prime
: pass:  561 is not prime

*** Solution

The sum can be rewritten like this:

\[\frac{h}{3}(y_0+4(\underbrace{y_1+y_3+y_5+\cdots+y_{n-1}}_\text{odd terms})+2(\underbrace{y_2+y_4+y_6+\cdots+y_{n-2}}_\text{even terms})+y_n)\]

#+name: sum
#+begin_src scheme :exports none
(define (sum term a next b)
  (if (> a b)
      0
      (+ (term a)
         (sum term (next a) next b))))
#+end_src

#+name: integral
#+begin_src scheme :exports none
(define (integral f a b dx)
  (define (add-dx x) (+ x dx))
  (* (sum f (+ a (/ dx 2.0)) add-dx b)
     dx))
#+end_src

#+name: integral-simpson
#+begin_src scheme :exports none
(define (integral-simpson f a b n)
  (define h (/ (- b a) n))
  (define (add-2h x) (+ x h h))
  (* (+ (f a)
        (* 4 (sum f (+ a h) add-2h b))
        (* 2 (sum f a       add-2h b))
        (f b)) ; b = a + nh
     (/ h 3)))
#+end_src

#+name: solution1.29
#+begin_src scheme :noweb yes :results output
<<sum>>
<<integral>>
<<integral-simpson>>
(define (cube x) (* x x x))

(display (integral cube 0 1 0.01))  (newline)
(display (integral cube 0 1 0.001)) (newline)
(newline)
(display (integral-simpson cube 0 1.0 100))  (newline)
(display (integral-simpson cube 0 1.0 1000)) (newline)
#+end_src

#+RESULTS: solution1.29
: 0.24998750000000042
: 0.249999875000001
:
: 0.25000000000000044
: 0.25000000000000083

The ~integral-simpson~ gives much more accuracy for the same number of step.

*** Solution

#+name: solution1.30
#+begin_src scheme :exports none
(define (sum term a next b)
  (define (iter a result)
    (if (> a b)
        result
        (iter (next a) (+ (term a) result))))
  (iter a 0))
#+end_src

#+begin_src scheme :noweb yes :results output
<<solution1.30>>
<<cube>>
<<inc>>
<<sum-cube-inc>>
<<identity>>
<<sum-identity-inc>>
<<sum-pi-term-next>>
<<integral>>

(display (sum-cubes 1 10))          (newline)
(display (sum-integers 1 10))       (newline)
(display (* 8 (pi-sum 1 1000)))     (newline)
(display (integral cube 0 1 0.01))  (newline)
(display (integral cube 0 1 0.001)) (newline)
#+end_src

#+RESULTS:
: 3025
: 55
: 3.139592655589782
: 0.24998750000000042
: 0.24999987500000073

**** Implementing ~factorial~ in terms of ~product~

#+name: factorial-via-product
#+begin_src scheme :noweb yes :results output
<<higher-order-product>>
(define (identity x) x)
(define (inc x) (+ x 1))
(define (factorial num)
  (product identity 1 inc num))

(display (factorial 4)) (newline)
(display (factorial 10)) (newline)
#+end_src

#+RESULTS: factorial-via-product
: 24
: 3628800

**** Implementing Wallis' product for \(\pi\) in terms of ~product~

The formula above to compute approximations to \(\pi\) is called the *Wallis product* for \(\pi\), published in 1656 by [[https://en.wikipedia.org/wiki/John_Wallis][John Wallis]], states that

\begin{align*}
\frac{\pi}{2}&=\prod_{n=1}^{\infty} \frac{4n^2}{4n^2-1}=\prod_{n=1}^{\infty}\left(\frac{2n}{2n-1} \cdot \frac{2n}{2n-2} \right) \\
&=\left(\frac{2}{1}\cdot\frac{2}{3}\right)\cdot\left(\frac{4}{3}\cdot\frac{4}{5}\right)\cdot\left(\frac{6}{5}\cdot\frac{6}{7}\right)\cdot\left(\frac{8}{7}\cdot\frac{8}{9}\right)\cdot \cdots
\end{align*}

This formula can be implemented directly using the ~product~ function:

#+name: approximate-pi
#+begin_src scheme :noweb yes :results output
<<higher-order-product>>
(define (inc x) (+ x 1))
(define (approx-pi n)
  (define (term n)
    (* (/ (* 2 n)
          (- (* 2 n) 1))
       (/ (* 2 n)
          (+ (* 2 n) 1))))
  (* 2 (product term 1.0 inc n)))

(display (approx-pi 100))  (newline)
(display (approx-pi 1000)) (newline)
#+end_src

#+RESULTS: approximate-pi
: 3.13378749062816
: 3.140807746030383

**** Implementing iterative ~product~

#+name: iterative-higher-order-product
#+begin_src scheme :exports none
(define (product term a next b)
  (define (iter a result)
    (if (> a b)
        result
        (iter (next a) (* (term a) result))))
  (iter a 1))
#+end_src

#+begin_src scheme :noweb yes :results output :exports none
<<iterative-higher-order-product>>
(define (identity x) x)
(define (inc x) (+ x 1))
(define (factorial num)
  (product identity 1 inc num))

(display (factorial 4)) (newline)
(display (factorial 10)) (newline)
#+end_src

#+RESULTS:
: 24
: 3628800

**** Implementing ~sum~ and ~product~ in terms of ~accumulate~

#+name: accumulate-sum
#+begin_src scheme :exports none
(define (sum term a next b)
  (accumulate + 0 term a next b))
#+end_src

#+name: test-accumulate-sum
#+begin_src scheme :noweb yes :results output :exports none
<<recursive-accumulate>>
<<accumulate-sum>>
(define (inc n) (+ n 1))
(define (identity x) x)
(define (sum-integers a b)
  (sum identity a inc b))

(display (sum-integers 1 10))
#+end_src

#+RESULTS: test-accumulate-sum
: 55

#+name: accumulate-product
#+begin_src scheme :exports none
(define (product term a next b)
  (accumulate * 1 term a next b))
#+end_src

#+name: test-accumulate-product
#+begin_src scheme :noweb yes :results output :exports none
<<recursive-accumulate>>
<<accumulate-product>>
(define (identity x) x)
(define (inc x) (+ x 1))
(define (factorial num)
  (product identity 1 inc num))

(display (factorial 4)) (newline)
(display (factorial 10)) (newline)
#+end_src

#+RESULTS: test-accumulate-product
: 24
: 3628800

**** Implementing iterative ~accumulate~

#+name: iterative-accumulate
#+begin_src scheme :exports none
(define (accumulate combiner null-value term a next b)
  (define (iter a result)
    (if (> a b)
        result
        (iter (next a) (combiner (term a) result))))
  (iter a null-value))
#+end_src

#+name: test-iterative-accumulate
#+begin_src scheme :noweb yes :results output :exports none
<<iterative-accumulate>>
(define (product term a next b)
  (accumulate * 1 term a next b))
(define (inc n) (+ n 1))
(define (identify n) n)
(define (factorial num)
  (product identify 1 inc num))

(display (factorial 4)) (newline)
(display (factorial 10)) (newline)
#+end_src

#+RESULTS: test-iterative-accumulate
: 24
: 3628800

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: fixed-point
#+begin_src scheme :exports none
(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (< (abs (- v1 v2))
       tolerance))
  (define (try guess)
    (let ((next (f guess)))
      (if (close-enough? guess next)
          next
          (try next))))
  (try first-guess))
#+end_src

#+name: golden-ratio
#+begin_src scheme
<<fixed-point>>
(displayln (fixed-point (lambda (x) (+ 1 (/ 1 x)))
             1.0))
#+end_src

#+RESULTS: golden-ratio
: 1.6180327868852458

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: modified-fixed-point
#+begin_src scheme :exports none
(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (< (abs (- v1 v2))
       tolerance))
  (define (try guess)
    (let ((next (f guess)))
      (display next)
      (newline)
      (if (close-enough? guess next)
          next
          (try next))))
  (try first-guess))
#+end_src

#+name: without-average-damping
#+begin_src scheme
<<modified-fixed-point>>
(displayln (fixed-point (lambda (x) (/ (log 1000) (log x))) 2.0))
#+end_src

#+RESULTS: without-average-damping
#+begin_example
9.965784284662087
3.004472209841214
6.279195757507157
3.759850702401539
5.215843784925895
4.182207192401397
4.8277650983445906
4.387593384662677
4.671250085763899
4.481403616895052
4.6053657460929
4.5230849678718865
4.577114682047341
4.541382480151454
4.564903245230833
4.549372679303342
4.559606491913287
4.552853875788271
4.557305529748263
4.554369064436181
4.556305311532999
4.555028263573554
4.555870396702851
4.555315001192079
4.5556812635433275
4.555439715736846
4.555599009998291
4.555493957531389
4.555563237292884
4.555517548417651
4.555547679306398
4.555527808516254
4.555540912917957
4.555532270803653
4.555532270803653
#+end_example

#+name: with-average-damping
#+begin_src scheme
<<modified-fixed-point>>
(displayln (fixed-point (lambda (x) (/ (+ x (/ (log 1000) (log x))) 2.0)) 2.0))
#+end_src

#+RESULTS: with-average-damping
#+begin_example
5.9828921423310435
4.922168721308343
4.628224318195455
4.568346513136242
4.5577305909237005
4.555909809045131
4.555599411610624
4.5555465521473675
4.555537551999825
4.555537551999825
#+end_example

It takes 35 steps to converge without damping, bug only 10 steps with the damping method. It is clear that damping makes the convergence faster in this case.

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: approximate-e
#+begin_src scheme :exports none
(define (d i)
  (if (= (modulo i 3) 2)
      (* 2 (/ (+ i 1) 3.0))
      1.0))
(define (appr-e k)
  (cont-frac (lambda (i) 1.0) d k))
#+end_src

#+name: solution1.38
#+begin_src scheme
<<k-term-finite-continued-fraction-iterative>>
<<approximate-e>>
(displayln (appr-e 10))
#+end_src

#+RESULTS: solution1.38
: 0.7182817182817183

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: tangent-lambert-formula
#+begin_src scheme :exports none
(define (tan-cf x k)
  (cont-frac (lambda (i) (if (= i 1) x (* x x -1)))
             (lambda (i) (- (* 2.0 i) 1))
             k))
#+end_src

#+name: solution1.39
#+begin_src scheme
<<k-term-finite-continued-fraction-iterative>>
<<tangent-lambert-formula>>
(displayln (tan-cf 1 10))
(displayln (tan 1))
#+end_src

#+RESULTS: solution1.39
: 1.557407724654902
: 1.5574077246549023

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: newtons-method
#+begin_src scheme :exports none
(define (deriv g)
  (lambda (x) (/ (- (g (+ x dx)) (g x)) dx)))

(define dx 0.00001)

(define (newton-transform g)
  (lambda (x) (- x (/ (g x) ((deriv g) x)))))

(define (newtons-method g guess)
  (fixed-point (newton-transform g) guess))
#+end_src

#+name: cubic-definition
#+begin_src scheme :exports none
(define (cubic a b c)
  (lambda (x) (+ (* x x x) (* a (* x x)) (* b x) c)))
#+end_src

#+name: solution1.40
#+begin_src scheme
<<modified-fixed-point>>
<<newtons-method>>
<<cubic-definition>>

(define a 1)
(define b 1)
(define c 1)
(displayln (newtons-method (cubic a b c) 1))
#+end_src

#+RESULTS: solution1.40
: 0.33333777776275186
: -0.40739341574970156
: -1.4188731238603447
: -1.1184919351394478
: -1.0124818785025846
: -1.000153742427375
: -1.000000022096024
: -0.9999999999997796
: -0.9999999999997796

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: double
#+begin_src scheme :exports none
(define (double f)
  (lambda (x) (f (f x))))
#+end_src

#+name: solution1.41
#+begin_src scheme
<<double>>
(define (inc x) (+ x 1))
(displayln (((double (double double)) inc) 5))
#+end_src

#+RESULTS: solution1.41
: 21

#+name: double-example-code-expansion
#+begin_src scheme
((double f) x) -> (f (f x))
(((double double) f) x) -> ((double (double f)) x)
(((double (double double)) f) x) -> (((double double) ((double double) f)) x)
                                 -> (((double double) (double (double f))) x)
                                 -> ((double (double (double (double f)))) x)
#+end_src

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: compose-two-functions
#+begin_src scheme :exports none
(define (compose f g)
  (lambda (x) (f (g x))))
#+end_src

#+begin_src scheme
<<compose-two-functions>>
(define (square x) (* x x))
(define (inc x) (+ x 1))
(displayln ((compose square inc) 6))
#+end_src

#+RESULTS:
: 49

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: repeated-application
#+begin_src scheme :exports none
(define (repeated f n)
  (if (= n 1)
      f
      (compose f (repeated f (- n 1)))))
#+end_src

#+begin_src scheme
<<compose-two-functions>>
<<repeated-application>>
(define (square x) (* x x))
(displayln ((repeated square 2) 5))
#+end_src

#+RESULTS:
: 625

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: nth-root-damped
#+begin_src scheme :exports none
(define (power base n)
  (if (= n 0)
      1
      ((repeated (lambda (x) (* base x)) n) 1)))
(define (nth-root-damped x nth damp)
  (fixed-point
   ((repeated average-damp damp)
    (lambda (y)
      (/ x (power y (- nth 1)))))
   1.0))
#+end_src

| nth          | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | ... | 31 | 32 | ... | 63 | 64 |
| minimal damp | 1 | 1 | 2 | 2 | 2 | 2 | 3 | 3 |  3 |  3 |  3 |  3 |  3 |  3 |  4 |   4 |  4 |  5 |   5 |  5 |  6 |

#+name: solution1.45
#+begin_src scheme
<<fixed-point>>
<<compose-two-functions>>
<<repeated-application>>
<<nth-root-damped>>
(define (average-damp f)
  (lambda (x) ((lambda (a b) (/ (+ a b) 2.0)) x (f x))))
(define (nth-root x nth)
  (fixed-point
   ((repeated average-damp (floor (log nth 2)))
    (lambda (y) (/ x (power y (- nth 1)))))
   1.0))

(displayln (nth-root 2 258))
#+end_src

#+RESULTS: solution1.45
: 1.0026902132630033

*** Solution
:PROPERTIES:
:header-args:scheme: :noweb yes :results output
:END:

#+name: iterative-improvement
#+begin_src scheme :exports none
(define (iterative-improve good-enough? improve)
  (define (iter guess)
    (if (good-enough? guess)
        guess
        (iter (improve guess))))
  (lambda (x) (iter x)))
#+end_src

#+name: iterative-improve-sqrt
#+begin_src scheme
<<iterative-improvement>>
(define (square n) (* n n))
(define (average a b) (/ (+ a b) 2.0))
(define (sqrt x)
  (define (good-enough? guess)
    (< (abs (- (square guess) x)) 0.001))
  (define (improve guess)
    (average guess (/ x guess)))
  ((iterative-improve good-enough? improve) 1.0))

(displayln (sqrt 256))
#+end_src

#+RESULTS: iterative-improve-sqrt
: 16.00000352670594

#+name: iterative-improve-fixed-point
#+begin_src scheme :exports none
(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? guess)
    (< (abs (- guess (f guess)))
       tolerance))
  ((iterative-improve close-enough? f) 1.0))
#+end_src

#+name: solution1.46
#+begin_src scheme
<<iterative-improvement>>
<<iterative-improve-fixed-point>>

(define (average a b) (/ (+ a b) 2.0))
(define (average-damp f)
  (lambda (x) (average x (f x))))
(define (sqrt x)
  (fixed-point (average-damp (lambda (y) (/ x y)))
               1.0))

(displayln (fixed-point cos 1.0))
(displayln (sqrt 256))
#+end_src

#+RESULTS: solution1.46
: 0.7390893414033927
: 16.00000352670594

